In [1]:
import pandas as pd

df = pd.read_csv('marketing_data.csv')
df.isnull().sum()
df.info()
# df.columns
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4    Income              2216 non-null   object
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   int64
 10  MntFruits            2240 non-null   int64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Response             2240 non-null   int64
 26  Complain             2240 non-null   int64
 27  Country              2240 non-null   object
dtypes: int64(23), object(5)
memory usage: 490.1+ KB

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Response,Complain,Country
0,1826,1970,Graduation,Divorced,"$84,835.00",0,0,6/16/14,0,189,...,6,1,0,0,0,0,0,1,0,SP
1,1,1961,Graduation,Single,"$57,091.00",0,0,6/15/14,0,464,...,7,5,0,0,0,0,1,1,0,CA
2,10476,1958,Graduation,Married,"$67,267.00",0,1,5/13/14,0,134,...,5,2,0,0,0,0,0,0,0,US
3,1386,1967,Graduation,Together,"$32,474.00",1,1,5/11/14,0,10,...,2,7,0,0,0,0,0,0,0,AUS
4,5371,1989,Graduation,Single,"$21,474.00",1,0,4/8/14,0,6,...,2,7,1,0,0,0,0,1,0,SP

In [2]:
print(df[' Income '].head(10))
# probably will delete this cell

0    $84,835.00
1    $57,091.00
2    $67,267.00
3    $32,474.00
4    $21,474.00
5    $71,691.00
6    $63,564.00
7    $44,931.00
8    $65,324.00
9    $65,324.00
Name:  Income , dtype: object

In [3]:
# 1. After importing the data, examine variables such as Dt_Customer and Income to verify their accurate importation.

In [4]:
print(df.columns.tolist())

['ID', 'Year_Birth', 'Education', 'Marital_Status', ' Income ', 'Kidhome', 'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases', 'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth', 'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1', 'AcceptedCmp2', 'Response', 'Complain', 'Country']

In [5]:
## I notice there is a space in income
df.columns = df.columns.str.strip()
print(df.columns.tolist()) # print to check and see if it's corrected.  

# the list of columns is small enough to visually check the rest of them for similar issues.  If it was a really large dataset, I would proactively strip them all.  If there were any special characters in the column names I would get rid of those too but I don't see any here.

['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome', 'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits', 'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts', 'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases', 'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth', 'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1', 'AcceptedCmp2', 'Response', 'Complain', 'Country']

In [6]:
print(df['Dt_Customer'])

0        6/16/14
1        6/15/14
2        5/13/14
3        5/11/14
4         4/8/14
          ...
2235      3/7/13
2236     1/22/13
2237     12/3/12
2238    11/29/12
2239      9/1/12
Name: Dt_Customer, Length: 2240, dtype: object

In [7]:
# this data is not in the correct datetime format (as also we learn from .info the datatype is an object) so I need to convert it.

In [8]:
print(df['Dt_Customer'].head())

0    6/16/14
1    6/15/14
2    5/13/14
3    5/11/14
4     4/8/14
Name: Dt_Customer, dtype: object

In [9]:
df['Dt_Customer'] = pd.to_datetime(df['Dt_Customer'], format='%m/%d/%y')
print(df['Dt_Customer'].head()) # to see if it works

0   2014-06-16
1   2014-06-15
2   2014-05-13
3   2014-05-11
4   2014-04-08
Name: Dt_Customer, dtype: datetime64[ns]

In [10]:
## 2. There are missing income values for some customers. Conduct missing value imputation, considering that customers with similar education and marital status tend to have comparable yearly incomes, on average. It may be necessary to cleanse the data before proceeding. Specifically, scrutinize the categories of education and marital status for data cleaning.  
print(df['Income'].head(10)) # first see what the data looks like

0    $84,835.00
1    $57,091.00
2    $67,267.00
3    $32,474.00
4    $21,474.00
5    $71,691.00
6    $63,564.00
7    $44,931.00
8    $65,324.00
9    $65,324.00
Name: Income, dtype: object

In [11]:
# convert income to numeric 
df['Income'] = df['Income'].replace({'\$': '', ',': ''}, regex=True).astype(float)
# check to see if it worked
print(df['Income'].head())

0    84835.0
1    57091.0
2    67267.0
3    32474.0
4    21474.0
Name: Income, dtype: float64

In [12]:
print("Missing Income values:", df['Income'].isnull().sum())

Missing Income values: 24

In [13]:
# so if I want to fill in the missing income values with the mean of what would be similar education and marital status, I want to take a look at that data first and see if anything needs to be cleaned up before I start working with it.
print(df['Education'].unique())
print(df['Marital_Status'].unique())

['Graduation' 'PhD' '2n Cycle' 'Master' 'Basic']
['Divorced' 'Single' 'Married' 'Together' 'Widow' 'YOLO' 'Alone' 'Absurd']

In [14]:
# some of the smartass answers for marital status could be a problem so checking to see how frequent they are and if I need to do anything with them
print(df['Marital_Status'].value_counts())

Marital_Status
Married     864
Together    580
Single      480
Divorced    232
Widow        77
Alone         3
YOLO          2
Absurd        2
Name: count, dtype: int64

In [15]:
# decided to group the marital status oddball entries in with "single" 
df['Marital_Status'] = df['Marital_Status'].replace({'Alone': 'Single', 'YOLO': 'Single', 'Absurd': 'Single'})
# see if it worked
print(df['Marital_Status'].value_counts())

Marital_Status
Married     864
Together    580
Single      487
Divorced    232
Widow        77
Name: count, dtype: int64

In [16]:
group_means = df.groupby(['Education', 'Marital_Status'])['Income'].mean().round(2)
print(group_means)

Education   Marital_Status
2n Cycle    Divorced          49395.13
            Married           46201.10
            Single            53673.94
            Together          44736.41
            Widow             51392.20
Basic       Divorced           9548.00
            Married           21960.50
            Single            18238.67
            Together          21240.07
            Widow             22123.00
Graduation  Divorced          54526.04
            Married           50800.26
            Single            51365.63
            Together          55758.48
            Widow             54976.66
Master      Divorced          50331.95
            Married           53286.03
            Single            53787.14
            Together          52109.01
            Widow             58401.55
PhD         Divorced          53096.62
            Married           58138.03
            Single            53039.67
            Together          56041.42
            Widow             60288.08
Name: Income, dtype: float64

In [17]:
# defining the function to fill lin missing income values based on the mean values corresponding to similar groups
def impute_income(row):
    if pd.isnull(row['Income']):
        try:
            return group_means.loc[(row['Education'], row['Marital_Status'])]
        except KeyError:
            return df['Income'].mean()  # Fallback option
    return row['Income']

df['Income'] = df.apply(impute_income, axis=1)
# confirm this worked
print("Remaining missing Income values:", df['Income'].isnull().sum())

Remaining missing Income values: 0

In [19]:
# 3. Create variables to represent the total number of children, age, and total spending.  Derive the total purchases from the number of transactions across the three channels.
## make new column for all children
df['Total_Children'] = df['Kidhome'] + df['Teenhome']
## get the age of the children (using 2014 because that's what the Dt_customer dates are from
df['Age'] = 2014 - df['Year_Birth']
df.columns # check if it worked

Index(['ID', 'Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntWines', 'MntFruits',
       'MntMeatProducts', 'MntFishProducts', 'MntSweetProducts',
       'MntGoldProds', 'NumDealsPurchases', 'NumWebPurchases',
       'NumCatalogPurchases', 'NumStorePurchases', 'NumWebVisitsMonth',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'AcceptedCmp2', 'Response', 'Complain', 'Country', 'Total_Children',
       'Age'],
      dtype='object')

In [21]:
# add a column for total spending
df['Total_Spending'] = (df['MntWines'] + df['MntFruits'] + df['MntMeatProducts'] +
                        df['MntFishProducts'] + df['MntSweetProducts'] + df['MntGoldProds'])
# for the number of transactions accross the three chanels
df['Total_Purchases'] = (df['NumWebPurchases'] + df['NumCatalogPurchases'] + df['NumStorePurchases'])
# check if it makes sense
print(df[['Total_Children', 'Age', 'Total_Spending', 'Total_Purchases']].head(30))

    Total_Children  Age  Total_Spending  Total_Purchases
0                0   44            1190               14
1                0   53             577               17
2                1   56             251               10
3                2   47              11                3
4                1   25              91                6
5                0   56            1192               16
6                0   60            1215               27
7                1   47              96                6
8                1   60             544               17
9                1   60             544               17
10               0   67            1208               21
11               1   35             222               10
12               0   55            1156               15
13               0   33              72                4
14               1   45             359               25
15               2   37             174                8
16               2   37             174                8
17               1   56              22                4
18               1   54              72                5
19               3   56              13                3
20               1   60             335               12
21               1   48             393               14
22               1   35              92                6
23               1   38             404               14
24               1   45             704               22
25               1   49             122                7
26               2   58             684               19
27               2   58             684               19
28               2   58              45                5
29               0   39             726               15